mdk09.01/larav/mvc.d2
direction: right

MVC.Model -> MVC.View: updates
MVC.Controller -> MVC.Model: manipulates
MVC.View -> User: sees
User -> MVC.Controller: uses
